src/cf/InformationRegisters/ПорядокУплатыАкцизов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПорядокУплатыАкцизов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛьготныйСрокУплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансыПриЗакупкеСырья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыПодакцизныхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПодакцизныхТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нефтепродукты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спирт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругиеТовары</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ПорядокУплатыАкцизов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НастройкиУплатыАкцизов() Экспорт

	Настройки = Новый ТаблицаЗначений;
	Настройки.Колонки.Добавить("ВидТовара",       Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПодакцизныхТоваров"));
	Настройки.Колонки.Добавить("ЗаголовокВыбора", Новый ОписаниеТипов("Строка")); // Заголовок переключателя в форме выбора
	Настройки.Колонки.Добавить("Варианты",        Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Настройки.Индексы.Добавить("ВидТовара");
	
	ВидыТоваров = Перечисления.ВидыПодакцизныхТоваров;
	
	// Нефтепродукты
	Настройка = Настройки.Добавить();
	Настройка.ВидТовара       = ВидыТоваров.Нефтепродукты;
	Настройка.ЗаголовокВыбора = НСтр("ru = 'Свидетельство на операции с прямогонным бензином'");
	Настройка.Варианты = НовыйТаблицаВарианты();
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.ЛьготныйСрокУплаты    = Истина;
	Вариант.ТекстВыбора           = НСтр("ru = 'получено'");
	Вариант.Представление         = НСтр("ru = 'Получено свидетельство на операции с прямогонным бензином'");
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.ЛьготныйСрокУплаты    = Ложь;
	Вариант.ТекстВыбора           = НСтр("ru = 'не получено'");
	Вариант.Представление         = НСтр("ru = 'Не получено свидетельство на операции с прямогонным бензином'");
	
	// Спирт
	Настройка = Настройки.Добавить();
	Настройка.ВидТовара       = ВидыТоваров.Спирт;
	Настройка.ЗаголовокВыбора = НСтр("ru = 'Свидетельство на производство денатурированного спирта'");
	Настройка.Варианты = НовыйТаблицаВарианты();
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.ЛьготныйСрокУплаты    = Истина;
	Вариант.ТекстВыбора           = НСтр("ru = 'получено'");
	Вариант.Представление         = НСтр("ru = 'Производится денатурированный спирт'");
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.ЛьготныйСрокУплаты    = Ложь;
	Вариант.ТекстВыбора           = НСтр("ru = 'не получено'");
	Вариант.Представление         = НСтр("ru = 'Производится неденатурированный спирт'");
	
	// СпиртосодержащаяПродукция
	Настройка = Настройки.Добавить();
	Настройка.ВидТовара       = ВидыТоваров.СпиртосодержащаяПродукция;
	Настройка.ЗаголовокВыбора = НСтр("ru = 'Свидетельство на использование денатурированного спирта'");
	Настройка.Варианты = НовыйТаблицаВарианты();
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.ЛьготныйСрокУплаты    = Истина;
	Вариант.ТекстВыбора           = НСтр("ru = 'получено'");
	Вариант.Представление         = НСтр("ru = 'Используется денатурированный спирт'");
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.ЛьготныйСрокУплаты    = Ложь;
	Вариант.ТекстВыбора           = НСтр("ru = 'не получено'");
	Вариант.Представление         = НСтр("ru = 'Используется неденатурированный спирт'");
	
	// АлкогольнаяПродукция
	Настройка = Настройки.Добавить();
	Настройка.ВидТовара       = ВидыТоваров.АлкогольнаяПродукция;
	Настройка.ЗаголовокВыбора = НСтр("ru = 'Авансы при закупке сырья'");
	Настройка.Варианты = НовыйТаблицаВарианты();
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.АвансыПриЗакупкеСырья = Ложь;
	Вариант.ТекстВыбора           = НСтр("ru = 'не уплачиваются'");
	Вариант.Представление         = НСтр("ru = 'Не уплачиваются авансы при закупке сырья'");
	
	Вариант = Настройка.Варианты.Добавить();
	Вариант.АвансыПриЗакупкеСырья = Истина;
	Вариант.ТекстВыбора           = НСтр("ru = 'уплачиваются'");
	Вариант.Представление         = НСтр("ru = 'Уплачиваются авансы при закупке сырья'");
	
	Возврат Настройки;
	
КонецФункции

Функция НовыйТаблицаВарианты()
	
	Варианты = РегистрыСведений.НалогиОтчеты.НовыйВариантыДетальнойНастройки();
	
	Варианты.Колонки.Добавить("ЛьготныйСрокУплаты",    Новый ОписаниеТипов("Булево"));
	Варианты.Колонки.Добавить("АвансыПриЗакупкеСырья", Новый ОписаниеТипов("Булево"));
	
	Возврат Варианты;
	
КонецФункции

#КонецЕсли
